## Quiz #0203

In [3]:
import pandas as pd
import numpy as np
import os

#### Read in the data.

In [ ]:
# Go to the directory where the data file is located. 
# os.chdir(r'~~')                # Please, replace the path with your own.

In [4]:
df = pd.read_csv('data_sales.csv', header='infer')

In [5]:
df.shape

(43, 5)

In [6]:
df.head(5)

          Date   Region     Item  UnitPrice  Units
0   4-Jul-2014     East  Pen Set       4.99     62
1  12-Jul-2014     East   Binder       1.99     29
2  21-Jul-2014  Central  Pen Set      12.49     55
3  29-Jul-2014     East   Binder      19.99     81
4   7-Aug-2014  Central  Pen Set      23.95     42

#### Answer the following questions.

1). Append a new variable $Amount = UnitPric \times Units$.

In [11]:
df['Amount']=df['UnitPrice']*df['Units']
df.head(5)

          Date   Region     Item  UnitPrice  Units   Amount
0   4-Jul-2014     East  Pen Set       4.99     62   309.38
1  12-Jul-2014     East   Binder       1.99     29    57.71
2  21-Jul-2014  Central  Pen Set      12.49     55   686.95
3  29-Jul-2014     East   Binder      19.99     81  1619.19
4   7-Aug-2014  Central  Pen Set      23.95     42  1005.90

2). Average unit price for each region. Use the groupby() method.

In [12]:
agg_func_math = {
    'UnitPrice': ['mean']}
df.groupby(['Region']).agg(agg_func_math).round(2)

        UnitPrice
             mean
Region
Central     18.02
East         9.14
West        53.66

3). Average unit price for each region. Use the pivot_table() method.

In [13]:
table = pd.pivot_table(df, values=['UnitPrice'], index=['Region'],
                    aggfunc={'UnitPrice': np.mean})
table

         UnitPrice
Region
Central  18.018750
East      9.143846
West     53.658333

4). Average unit price and units for each region in one code sentence. Use the groupby() method.

In [16]:
df.groupby(["Region"])["UnitPrice", "Units"].mean().unstack()

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  """Entry point for launching an IPython kernel.

           Region
UnitPrice  Central    18.018750
           East        9.143846
           West       53.658333
Units      Central    49.958333
           East       53.153846
           West       38.500000
dtype: float64

5). Average unit price and units for each region in one code sentence. Use the pivot_table() method.

In [19]:
table = pd.pivot_table(df, values=['UnitPrice','Units'], index=['Region'],
                    aggfunc={'UnitPrice': np.mean, 'Units' : np.mean})
table

         UnitPrice      Units
Region
Central  18.018750  49.958333
East      9.143846  53.153846
West     53.658333  38.500000

6). Total units for each region and item type in one code sentence. Use the pivot_table() method. Fill the missing values with 0.

In [20]:
table = pd.pivot_table(df, values=['Units'], index=['Region'],
                    aggfunc=np.sum, fill_value=0)
table

         Units
Region
Central   1199
East       691
West       231

7). Total sales amount for each region and item type in one code sentence. Use the pivot_table() method. Fill the missing values with 0.

In [21]:
table = pd.pivot_table(df, values=['Amount'], index=['Item','Region'],
                    aggfunc=np.sum, fill_value=0)
table

                  Amount
Item    Region
Binder  Central  5762.63
        East     2535.66
        West     1279.36
Desk    Central   875.00
        West      825.00
Pen     Central   539.73
        East     1354.25
        West      151.24
Pen Set Central  2421.39
        East     1748.48
Pencil  Central  1540.32
        East      363.70
        West      231.12